
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОповещенияКаргомарт.Параметры.УстановитьЗначениеПараметра("НазначенныйПолучатель", ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КПринятьОповещениеНаСервере(ОповещениеКлючЗаписи)
	
	МЗап = РегистрыСведений.КДВКаргомартОповещения.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗап, ОповещениеКлючЗаписи);
	МЗап.Прочитать();
	Если МЗап.Выбран() Тогда
		
		МЗап.Обработано 			= Истина;
		МЗап.ФактическийПолучатель 	= ПараметрыСеанса.ТекущийПользователь;
		МЗап.ДатаПолучения 			= ТекущаяДата();
		
		Попытка
			МЗап.Записать(Истина);
		Исключение
			Сообщить(КДВКаргомартКлиентСервер.СообщениеПользователю(14) + Символы.ПС + "Детальная информация: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КПринятьОповещение(Команда)
	
	КПринятьОповещениеНаСервере(Элементы.ОповещенияКаргомарт.ТекущаяСтрока);
	Элементы.ОповещенияКаргомарт.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияКаргомартПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ТекстОповещения = Элемент.ТекущиеДанные.ТекстОповещения;
	Иначе
		ТекстОповещения = "";
	КонецЕсли;
	
КонецПроцедуры
